In [36]:
# Shared Methods & Column Access in Pandas
import pandas as pd

rev=pd.read_csv('reven.csv',index_col=['Date'],squeeze=False)

In [37]:
# sum value column wise
rev.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [38]:
# other way of sum column wise
rev.sum("index")

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [39]:
# for getting sum row wise
rev.sum(axis=1).head()

Date
1/1/2016    1606
1/2/2016    2060
1/3/2016     967
1/4/2016    2519
1/5/2016     438
dtype: int64

In [40]:
# other way of getting sum row wise
rev.sum("columns").head()

Date
1/1/2016    1606
1/2/2016    2060
1/3/2016     967
1/4/2016    2519
1/5/2016     438
dtype: int64

In [59]:
# for  Extracting particular column but its not work if thare is an space between column Name

rev.Miami

Date
1/1/2016     499
1/2/2016     534
1/3/2016     933
1/4/2016     885
1/5/2016     253
1/6/2016     497
1/7/2016     115
1/8/2016     886
1/9/2016     823
1/10/2016    216
Name: Miami, dtype: int64

In [68]:
# if thare is an space in column name then we use list to extrac single or multiple column
rev['New York']

Date
1/1/2016     985
1/2/2016     738
1/3/2016      14
1/4/2016     730
1/5/2016     114
1/6/2016     936
1/7/2016     123
1/8/2016     935
1/9/2016     846
1/10/2016     54
Name: New York, dtype: int64

In [74]:
rev[['New York','Miami']]
    # or best way is
select = ['New York','Miami']
rev[select]

           New York  Miami
Date
1/1/2016        985    499
1/2/2016        738    534
1/3/2016         14    933
1/4/2016        730    885
1/5/2016        114    253
1/6/2016        936    497
1/7/2016        123    115
1/8/2016        935    886
1/9/2016        846    823
1/10/2016        54    216